# Створити рядок розмір, якого не менше 5 символів і не більше 15,
# 	Обміняти місцями половини рядка при чому в другій половині рядка перетворити останні 3 літери у великі.

str = "abcdefghij"                                             # Створити рядок розмір, якого не менше 5 символів і не більше 15,
if 4 < len(str) < 16:                                          # впишемо умову, при якій буде виконуватись алгоритм, а саме, якщо рядок не менше 5 символів і не більше 15. Беремол діапазон 4 < len(str) < 16, так як знаки <, > працюють швидше, ніж <=, >=
    s = len(str) // 2                                          # визначити середину рядка
    str_new = str.replace((str[:s]), "") + str[:s]             # Обміняти місцями половини рядка
    print(str_new[:(len(str_new) - 3)] + str_new[-3:].upper()) # в другій половині рядка перетворити останні 3 літери у великі.