# Створити рядок розмір, якого не менше 5 символів і не більше 15,
# 	Обміняти місцями половини рядка при чому в другій половині рядка перетворити останні 3 літери у великі.

str = "abcdefghij"       # Створити рядок розмір, якого не менше 5 символів і не більше 15,
s = len(str) // 2        # визначити середину рядка
str_new = str.replace((str[:s]), "") + str[:s]  # Обміняти місцями половини рядка
print(str_new[:(len(str_new) - 3)] + str_new[-3:].upper()) # в другій половині рядка перетворити останні 3 літери у великі.