# Створити рядок розміром не більше 10 символів та останні три
# 	символи перетворити на маленькі літери та перемістити в середину остачі символів(окрім 3ох останніх) рядка.

str = "ABCDEFGHI"                          # Створити рядок розміром не більше 10 символів
if len(str) < 11:
    s = str[-3:].lower()                   # останні три символи перетворити на маленькі літери
                                           # перемістити в середину остачі символів(окрім 3ох останніх) рядка.
    middle = len(str[:-3]) // 2            # для цього визначимо середину урізаного рядка
    str = str[:-3]                         # збережемо рядок в урізаному вигляді
    print(str[:middle] + s + str[middle:]) # зберемо зрізи рядка в купу
