# Сворити список мінімум з 10и елементів(тип данних для простоти int або float)
# 	a. Виведіть усі елементи списку з парними індексами.
# 	b. Знайти суму елементів всього списку.
# 	c. Знайти суму парних елементів списку та окремо непарних елементів списку.
# 	d. Виведіть значення найбільшого елемента у списку, а потім індекс цього елемента у списку.
# 		Якщо найбільших елементів кілька, виведіть індекс першого з них.

lst = [1, 10, 1.5, -5, 8.7, 54, -1368, 4.5, 0, 89, 5]

if len(lst) > 9:
    print("Виведіть усі елементи списку з парними індексами: " + str(lst[::2]))
    print("Знайти суму елементів всього списку: " + str(sum(lst)))
    print("Знайти суму парних елементів списку (якщо малось на увазі 'парні по індексу'): " + str(sum(lst[::2])))
    print("Знайти суму непарних елементів списку (якщо малось на увазі 'непарні по індексу'): " + str(sum(lst[1::2])))
    print("Виведіть значення найбільшого елемента у списку: " + str(max(lst)), "Виведіть індекс наібільшого елемента у списку: " + str(lst.index(max(lst))), sep='\n')

# 	c. Знайти суму парних елементів списку та окремо непарних елементів списку (якщо малось на увазі "парні та непарні числа")
if len(lst) > 9:
    s_even = 0
    s_odd = 0
    for i in range(len(lst)):
        if lst[i] % 2:
            s_odd += lst[i]
        else:
            s_even += lst[i]
    print("Сума непарних елементів: " + str(s_odd), "Сума парних елементів: " + str(s_even), sep='\n')
